<template>
  <v-container grid-list-sm>
    <v-layout
      row
      wrap
    >

      <v-flex
        xs4
        v-for="movie in movies"
        :key="movie.title"
      >
        <v-card>
          <v-card-title primary-title>
            <h3 class="headline"> {{movie.title}}</h3>

            <span class="grey-text">{{movie.year}}</span>
          </v-card-title>
          <v-card-text>
            {{movie.description}}
          </v-card-text>
          <v-card-actions>
            <v-btn
              flat
              color="purple"
            >评分</v-btn>
            <v-spacer></v-spacer>
          </v-card-actions>
        </v-card>
      </v-flex>

    </v-layout>
  </v-container>
</template>

<script>
export default {
  data() {
    return {
      movies: [
        {
          title: "天空之城",
          year: "1986-8-2",
          description:
            "小姑娘希达（SHEETA）是传说中“天空之城拉普达（Laputa）”王族的后裔，那曾是超越地上文明不知几千年的空中文明，但不知为何，希达的祖先离开“天空之城”，抛弃发达的科技，在地面上过起隐居的生活。然而一天，几个不明身份的男子出现在她家门口。"
        },
        {
          title: "龙猫",
          year: "1988-4-16",
          description:
            "为了方便妻子草壁靖子养病，草壁达郎决定带着两个女儿草壁皋月和草壁米搬到草壁靖子所在疗养院附近的乡下，父女三人入住了一间年久失修的老房子。小姐妹俩很快发现看似平凡无奇的乡下有很多神奇的事物，无人居住的房屋里能聚能散还能飞的“煤灰”、森林里的小精灵、森林的主人龙猫和笑口常开的猫巴士。"
        },
        {
          title: "哈尔的移动城堡",
          year: "2004-11-20",
          description:
            "该片改编自英国的儿童小说家黛安娜·W·琼斯的《魔法师哈威尔与火之恶魔》，谱出了一段战地恋曲，透过这唯美的画面，观众读到的不是孤独的等待，而是执着、感动人心的爱情。"
        },
        {
          title: "千与千寻",
          year: "2001-07-20",
          description:
            "该片讲述了少女千寻意外来到神灵异世界后，为了救爸爸妈妈，经历了很多磨难的故事。2001年该片在日本最终取得了304亿日元的票房。2003年，获得第75届奥斯卡金像奖最佳动画长片奖》在第52届柏林电影节上荣获金熊奖，成为电影史上第一部获得国际电影节最佳电影奖的动画作品。"
        },
        {
          title: "侧耳倾听",
          year: "1995-07-150",
          description:
            "根据柊葵的同名漫画改编，由多次在宫崎骏作品中出任作画监督的近藤喜文担任导演。该片讲述了一个发生在1994年的故事，作画的背景大部分来自东京附近的多摩市中心。男女主角互相勉励互相学习，为各自的理想而奋斗，叙述了少男少女间清纯真挚感人的恋爱故事，表达出作者对生活的态度和积极进取的精神。"
        },
        {
          title: "幽灵公主",
          year: "1997-07-12",
          description:
            "《幽灵公主》传承自宫崎骏长久以来关于人与自然之间的深邃思考。影片不拘泥于人类对环境的破坏，而是从人与自然之间无从化解的天然矛盾出发，通过人类自身的生存角度，探寻人类与自然是否能够真正实现和谐共存这一终极命题。"
        },
        {
          title: "借东西的小人阿莉埃蒂",
          year: "2010-7-17",
          description:
            "是日本吉卜力工作室制作的动画电影，也是米林宏昌执导的首部电影。影片于2010年7月17日在日本正式上映。《时代》杂志评价影片虽然没能达到《千与千寻》、《幽灵公主》、《风之谷》那样的高度，但吉卜力动画的优点都有在这片中体现。"
        },
        {
          title: "魔女宅急便",
          year: "1989-07-29",
          description:
            "《魔女宅急便》讲述的是魔法少女琪琪离开家进行独立修行的经历。这部电影描绘出日本一般青春期女孩在希望独立与自力更生所面临的困境。"
        }
      ]
    };
  },
  components: {}
};
</script>
